In [1]:
import json
import zipfile
from io import StringIO

import numpy as np
import pandas as pd
import sqlalchemy as sa

# from utils import show_versions
# show_versions()

pd.set_option(
    "display.max_columns", 8, "display.max_rows", 10, "display.max_colwidth", 40
)

## Creating and Persisting DataFrames

### How to do it\...

**Parallel lists of data and a dictionary mapping columns to data**

In [2]:
fname = ["Paul", "John", "Richard", "George"]
lname = ["McCartney", "Lennon", "Starkey", "Harrison"]
birth = [1942, 1940, 1940, 1943]

In [3]:
people = {"first": fname, "last": lname, "birth": birth}

In [4]:
beatles = pd.DataFrame(people)
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

### How it works\...

In [5]:
beatles.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
pd.DataFrame(people, index=["a", "b", "c", "d"])

     first       last  birth
a     Paul  McCartney   1942
b     John     Lennon   1940
c  Richard    Starkey   1940
d   George   Harrison   1943

### There\'s More

**List of dictionaries : each dict is a row**

In [7]:
pd.DataFrame(
    [
        {"first": "Paul", "last": "McCartney", "birth": 1942},
        {"first": "John", "last": "Lennon", "birth": 1940},
        {"first": "Richard", "last": "Starkey", "birth": 1940},
        {"first": "George", "last": "Harrison", "birth": 1943},
    ]
)

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [8]:
pd.DataFrame(
    [
        {"first": "Paul", "last": "McCartney", "birth": 1942},
        {"first": "John", "last": "Lennon", "birth": 1940},
        {"first": "Richard", "last": "Starkey", "birth": 1940},
        {"first": "George", "last": "Harrison", "birth": 1943},
    ],
    columns=["last", "first", "birth"],
)

        last    first  birth
0  McCartney     Paul   1942
1     Lennon     John   1940
2    Starkey  Richard   1940
3   Harrison   George   1943

### How to do it\...

**Saving and reading - CSV**

In [9]:
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [10]:
fout = StringIO()
beatles.to_csv(fout)  # use a filename instead of fout

In [11]:
print(fout.getvalue())

,first,last,birth
0,Paul,McCartney,1942
1,John,Lennon,1940
2,Richard,Starkey,1940
3,George,Harrison,1943

### There\'s More

In [12]:
_ = fout.seek(0)
pd.read_csv(fout)

   Unnamed: 0    first       last  birth
0           0     Paul  McCartney   1942
1           1     John     Lennon   1940
2           2  Richard    Starkey   1940
3           3   George   Harrison   1943

In [13]:
_ = fout.seek(0)
pd.read_csv(fout, index_col=0)

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [14]:
fout = StringIO()
beatles.to_csv(fout, index=False)
print(fout.getvalue())

first,last,birth
Paul,McCartney,1942
John,Lennon,1940
Richard,Starkey,1940
George,Harrison,1943

### How to do it\...

In [15]:
diamonds = pd.read_csv("../data/diamonds.csv", nrows=1000)
diamonds

     carat      cut color clarity  ...  price     x     y     z
0     0.23    Ideal     E     SI2  ...    326  3.95  3.98  2.43
1     0.21  Premium     E     SI1  ...    326  3.89  3.84  2.31
2     0.23     Good     E     VS1  ...    327  4.05  4.07  2.31
3     0.29  Premium     I     VS2  ...    334  4.20  4.23  2.63
4     0.31     Good     J     SI2  ...    335  4.34  4.35  2.75
..     ...      ...   ...     ...  ...    ...   ...   ...   ...
995   0.54    Ideal     D    VVS2  ...   2897  5.30  5.34  3.26
996   0.72    Ideal     E     SI1  ...   2897  5.69  5.74  3.57
997   0.72     Good     F     VS1  ...   2897  5.82  5.89  3.48
998   0.74  Premium     D     VS2  ...   2897  5.81  5.77  3.58
999   1.12  Premium     J     SI2  ...   2898  6.68  6.61  4.03

[1000 rows x 10 columns]

In [16]:
diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float64
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float64
 5   table    1000 non-null   float64
 6   price    1000 non-null   int64
 7   x        1000 non-null   float64
 8   y        1000 non-null   float64
 9   z        1000 non-null   float64
dtypes: float64(6), int64(1), object(3)
memory usage: 78.3+ KB

In [17]:
diamonds2 = pd.read_csv(
    "../data/diamonds.csv",
    nrows=1000,
    dtype={
        "carat": np.float32,
        "depth": np.float32,
        "table": np.float32,
        "x": np.float32,
        "y": np.float32,
        "z": np.float32,
        "price": np.int16,
    },
)

In [18]:
diamonds2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
 7   x        1000 non-null   float32
 8   y        1000 non-null   float32
 9   z        1000 non-null   float32
dtypes: float32(6), int16(1), object(3)
memory usage: 49.0+ KB

In [19]:
diamonds.describe()

,carat,depth,table,price,x,y,z
count,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000
mean,0.689280,61.722800,57.734700,2476.54000,5.605940,5.599180,3.457530
std,0.195291,1.758879,2.467946,839.57562,0.625173,0.611974,0.389819
min,0.200000,53.000000,52.000000,326.00000,3.790000,3.750000,2.270000
25%,0.700000,60.900000,56.000000,2777.00000,5.640000,5.630000,3.450000
50%,0.710000,61.800000,57.000000,2818.00000,5.770000,5.760000,3.550000
75%,0.790000,62.600000,59.000000,2856.00000,5.920000,5.910000,3.640000
max,1.270000,69.500000,70.000000,2898.00000,7.120000,7.050000,4.330000

In [20]:
diamonds2.describe()

,carat,depth,table,price,x,y,z
count,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000
mean,0.689280,61.722801,57.734699,2476.54000,5.605940,5.599180,3.457530
std,0.195291,1.758879,2.467946,839.57562,0.625173,0.611974,0.389819
min,0.200000,53.000000,52.000000,326.00000,3.790000,3.750000,2.270000
25%,0.700000,60.900002,56.000000,2777.00000,5.640000,5.630000,3.450000
50%,0.710000,61.799999,57.000000,2818.00000,5.770000,5.760000,3.550000
75%,0.790000,62.599998,59.000000,2856.00000,5.920000,5.910000,3.640000
max,1.270000,69.500000,70.000000,2898.00000,7.120000,7.050000,4.330000

In [21]:
diamonds2.cut.value_counts()

cut
Ideal        333
Premium      290
Very Good    226
Good          89
Fair          62
Name: count, dtype: int64

In [22]:
diamonds2.color.value_counts()

color
E    240
F    226
G    139
D    129
H    125
I     95
J     46
Name: count, dtype: int64

In [23]:
diamonds2.clarity.value_counts()

clarity
SI1     306
VS2     218
VS1     159
SI2     154
VVS2     62
VVS1     58
I1       29
IF       14
Name: count, dtype: int64

In [24]:
diamonds3 = pd.read_csv(
    "../data/diamonds.csv",
    nrows=1000,
    dtype={
        "carat": np.float32,
        "depth": np.float32,
        "table": np.float32,
        "x": np.float32,
        "y": np.float32,
        "z": np.float32,
        "price": np.int16,
        "cut": "category",
        "color": "category",
        "clarity": "category",
    },
)

In [25]:
diamonds3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
 7   x        1000 non-null   float32
 8   y        1000 non-null   float32
 9   z        1000 non-null   float32
dtypes: category(3), float32(6), int16(1)
memory usage: 29.4 KB

In [26]:
np.iinfo(np.int8)

iinfo(min=-128, max=127, dtype=int8)

In [27]:
np.finfo(np.float16)

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

In [28]:
cols = ["carat", "cut", "color", "clarity", "depth", "table", "price"]
diamonds4 = pd.read_csv(
    "../data/diamonds.csv",
    nrows=1000,
    dtype={
        "carat": np.float32,
        "depth": np.float32,
        "table": np.float32,
        "price": np.int16,
        "cut": "category",
        "color": "category",
        "clarity": "category",
    },
    usecols=cols,
)

In [29]:
diamonds4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
dtypes: category(3), float32(3), int16(1)
memory usage: 17.6 KB

In [30]:
cols = ["carat", "cut", "color", "clarity", "depth", "table", "price"]
diamonds_iter = pd.read_csv(
    "../data/diamonds.csv",
    nrows=1000,
    dtype={
        "carat": np.float32,
        "depth": np.float32,
        "table": np.float32,
        "price": np.int16,
        "cut": "category",
        "color": "category",
        "clarity": "category",
    },
    usecols=cols,
    chunksize=200,
)

In [31]:
def process(df):
    return f"processed {df.size} items"

In [32]:
diamonds_iter

In [33]:
for chunk in diamonds_iter:
    print(process(chunk))

processed 1400 items
processed 1400 items
processed 1400 items
processed 1400 items
processed 1400 items

### How it works\...

### There\'s more \...

In [34]:
diamonds.price.memory_usage()

8132

In [35]:
diamonds.price.memory_usage(index=False)

8000

In [36]:
diamonds.cut.memory_usage()

8132

In [37]:
diamonds.cut.memory_usage(deep=True)

55465

**Saving and reading - Feather**

In [38]:
diamonds4.to_feather("/tmp/d.arr")
diamonds5 = pd.read_feather("/tmp/d.arr")

**Saving and reading - Parquet**

In [39]:
diamonds4.to_parquet("/tmp/d.pqt")

### How to do it\...

**Saving and reading - Excel**

In [40]:
beatles.to_excel("/tmp/beat.xlsx")

In [41]:
beat2 = pd.read_excel("/tmp/beat.xlsx")
beat2

   Unnamed: 0    first       last  birth
0           0     Paul  McCartney   1942
1           1     John     Lennon   1940
2           2  Richard    Starkey   1940
3           3   George   Harrison   1943

In [42]:
beat2 = pd.read_excel("/tmp/beat.xlsx", index_col=0)
beat2

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [43]:
beat2.dtypes

first    object
last     object
birth     int64
dtype: object

### How it works\...

### There\'s more\...

In [44]:
with pd.ExcelWriter("/tmp/beat.xlsx") as writer:
    beatles.to_excel(writer, sheet_name="All")
    beatles[beatles.birth < 1941].to_excel(writer, sheet_name="1940")

### How to do it\...

In [45]:
autos = pd.read_csv("../data/vehicles.csv.zip")
autos

/tmp/ipykernel_60504/3310375595.py:1: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
  autos = pd.read_csv("../data/vehicles.csv.zip")

,barrels08,barrelsA08,charge120,charge240,...,startStop,phevCity,phevHwy,phevComb
0,15.695714,0.0,0.0,0.0,...,NaN,0,0,0
1,29.964545,0.0,0.0,0.0,...,NaN,0,0,0
2,12.207778,0.0,0.0,0.0,...,NaN,0,0,0
3,29.964545,0.0,0.0,0.0,...,NaN,0,0,0
4,17.347895,0.0,0.0,0.0,...,NaN,0,0,0
...,...,...,...,...,...,...,...,...,...
39096,14.982273,0.0,0.0,0.0,...,NaN,0,0,0
39097,14.330870,0.0,0.0,0.0,...,NaN,0,0,0
39098,15.695714,0.0,0.0,0.0,...,NaN,0,0,0
39099,15.695714,0.0,0.0,0.0,...,NaN,0,0,0
39100,18.311667,0.0,0.0,0.0,...,NaN,0,0,0

In [46]:
# DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
# autos = pd.read_csv("../data/vehicles.csv.zip")

autos.iloc[
    :, [70, 71, 72, 73, 74, 76, 79]
].columns  # doen't impact the column we look next `modifiedOn`

Index(['fuelType2', 'rangeA', 'evMotor', 'mfrCode', 'c240Dscr', 'c240bDscr',
       'startStop'],
      dtype='object')

In [47]:
autos.modifiedOn.dtype

dtype('O')

In [48]:
autos.modifiedOn  # doctest: +SKIP

0        Tue Jan 01 00:00:00 EST 2013
1        Tue Jan 01 00:00:00 EST 2013
2        Tue Jan 01 00:00:00 EST 2013
3        Tue Jan 01 00:00:00 EST 2013
4        Tue Jan 01 00:00:00 EST 2013
                     ...
39096    Tue Jan 01 00:00:00 EST 2013
39097    Tue Jan 01 00:00:00 EST 2013
39098    Tue Jan 01 00:00:00 EST 2013
39099    Tue Jan 01 00:00:00 EST 2013
39100    Tue Jan 01 00:00:00 EST 2013
Name: modifiedOn, Length: 39101, dtype: object

In [49]:
autos.modifiedOn.value_counts()

modifiedOn
Tue Jan 01 00:00:00 EST 2013    29438
Mon Sep 26 00:00:00 EDT 2016     6357
Wed Apr 05 00:00:00 EDT 2017      916
Tue Nov 22 00:00:00 EST 2016      208
Fri Dec 02 00:00:00 EST 2016      183
                                ...
Tue Aug 02 00:00:00 EDT 2016        1
Mon Jan 06 00:00:00 EST 2014        1
Fri Dec 16 00:00:00 EST 2016        1
Wed Jul 27 00:00:00 EDT 2016        1
Fri Mar 21 00:00:00 EDT 2014        1
Name: count, Length: 68, dtype: int64

#### Handling FutureWarning and ValueError:


>```bash
>FutureWarning: Parsed string "Tue Jan 01 00:00:00 EST 2013" included an un-recognized timezone "EST". 
>Dropping unrecognized timezones is deprecated; in a future version this will raise. 
>Instead pass the string without the timezone, then use .tz_localize to convert to a recognized timezone.
>  pd.to_datetime(autos.modifiedOn)
>```
____
>```bash
>ValueError: time data "Fri Apr 01 00:00:00 EDT 2016" doesn't match format "%a %b %d %H:%M:%S EST %Y", at position 1. You might want to try:
>    - passing `format` if your strings have a consistent format;
>    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
>    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.
>```

In [50]:
autos_parsed_date_1 = pd.read_csv(
    "../data/vehicles.csv.zip", parse_dates=["modifiedOn"]
)  # doctest: +SKIP
autos_parsed_date_1.modifiedOn

/tmp/ipykernel_60504/2569215401.py:1: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
  autos_parsed_date_1 = pd.read_csv(
/tmp/ipykernel_60504/2569215401.py:1: FutureWarning: Parsed string "Tue Jan 01 00:00:00 EST 2013" included an un-recognized timezone "EST". Dropping unrecognized timezones is deprecated; in a future version this will raise. Instead pass the string without the timezone, then use .tz_localize to convert to a recognized timezone.
  autos_parsed_date_1 = pd.read_csv(

0        Tue Jan 01 00:00:00 EST 2013
1        Tue Jan 01 00:00:00 EST 2013
2        Tue Jan 01 00:00:00 EST 2013
3        Tue Jan 01 00:00:00 EST 2013
4        Tue Jan 01 00:00:00 EST 2013
                     ...
39096    Tue Jan 01 00:00:00 EST 2013
39097    Tue Jan 01 00:00:00 EST 2013
39098    Tue Jan 01 00:00:00 EST 2013
39099    Tue Jan 01 00:00:00 EST 2013
39100    Tue Jan 01 00:00:00 EST 2013
Name: modifiedOn, Length: 39101, dtype: object


**Option 1:** setting timezone

In [51]:
try:
    pd.to_datetime(autos.modifiedOn)
except ValueError as e:
    print("ValueError", e)
    print("Setting timezone to US/Eastern")
    # First parse ignoring the abbreviation
    modifiedOn_tz = pd.to_datetime(
        autos.modifiedOn.str.replace(
            r" (EST|EDT|CST|CDT|MST|MDT|PST|PDT) ", " ", regex=True
        ),
        format="%a %b %d %H:%M:%S %Y",
    )
    # Then localize to Eastern timezone if needed
    modifiedOn_tz = modifiedOn_tz.dt.tz_localize("US/Eastern")

    # print("ValueError", e)
    # print('Trying with `format="mixed"`')
    # modifiedOn_tz = pd.to_datetime(autos.modifiedOn, format="mixed")
modifiedOn_tz

/tmp/ipykernel_60504/2330172091.py:2: FutureWarning: Parsed string "Tue Jan 01 00:00:00 EST 2013" included an un-recognized timezone "EST". Dropping unrecognized timezones is deprecated; in a future version this will raise. Instead pass the string without the timezone, then use .tz_localize to convert to a recognized timezone.
  pd.to_datetime(autos.modifiedOn)

ValueError time data "Fri Apr 01 00:00:00 EDT 2016" doesn't match format "%a %b %d %H:%M:%S EST %Y", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.
Setting timezone to US/Eastern

0       2013-01-01 00:00:00-05:00
1       2013-01-01 00:00:00-05:00
2       2013-01-01 00:00:00-05:00
3       2013-01-01 00:00:00-05:00
4       2013-01-01 00:00:00-05:00
                   ...
39096   2013-01-01 00:00:00-05:00
39097   2013-01-01 00:00:00-05:00
39098   2013-01-01 00:00:00-05:00
39099   2013-01-01 00:00:00-05:00
39100   2013-01-01 00:00:00-05:00
Name: modifiedOn, Length: 39101, dtype: datetime64[ns, US/Eastern]


**Option 2:** deleting timezone before using pd.to_datetime

In [52]:
autos_parsed_date_2 = pd.read_csv("../data/vehicles.csv.zip")
autos_parsed_date_2["modifiedOn"] = autos_parsed_date_2.modifiedOn.str.replace(
    r" [A-Z]{3,4} ", " ", regex=True
)
autos_parsed_date_2["modifiedOn"] = pd.to_datetime(
    autos_parsed_date_2.modifiedOn, format="%a %b %d %H:%M:%S %Y"
)
autos_parsed_date_2.modifiedOn

/tmp/ipykernel_60504/410023190.py:1: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
  autos_parsed_date_2 = pd.read_csv("../data/vehicles.csv.zip")

0       2013-01-01
1       2013-01-01
2       2013-01-01
3       2013-01-01
4       2013-01-01
           ...
39096   2013-01-01
39097   2013-01-01
39098   2013-01-01
39099   2013-01-01
39100   2013-01-01
Name: modifiedOn, Length: 39101, dtype: datetime64[ns]

In [53]:
# Selecting Optiona 1:

autos = pd.read_csv("../data/vehicles.csv.zip")

modifiedOn_tz = pd.to_datetime(
    autos.modifiedOn.str.replace(
        r" (EST|EDT|CST|CDT|MST|MDT|PST|PDT) ", " ", regex=True
    ),
    format="%a %b %d %H:%M:%S %Y",
)
# Then localize to Eastern timezone if needed
autos = autos.assign(modifiedOn=modifiedOn_tz.dt.tz_localize("US/Eastern"))

autos.modifiedOn

/tmp/ipykernel_60504/2406091220.py:3: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
  autos = pd.read_csv("../data/vehicles.csv.zip")

0       2013-01-01 00:00:00-05:00
1       2013-01-01 00:00:00-05:00
2       2013-01-01 00:00:00-05:00
3       2013-01-01 00:00:00-05:00
4       2013-01-01 00:00:00-05:00
                   ...
39096   2013-01-01 00:00:00-05:00
39097   2013-01-01 00:00:00-05:00
39098   2013-01-01 00:00:00-05:00
39099   2013-01-01 00:00:00-05:00
39100   2013-01-01 00:00:00-05:00
Name: modifiedOn, Length: 39101, dtype: datetime64[ns, US/Eastern]

**Saving and reading - Zip files**

In [54]:
with zipfile.ZipFile("../data/kaggle-survey-2018.zip") as z:
    print("\n".join(z.namelist()))

    kag = pd.read_csv(z.open("multipleChoiceResponses.csv"))
    display(kag)

    # look into the questions and their length
    kag_questions = kag.iloc[0]
    display(
        pd.concat(
            [kag_questions, kag_questions.apply(len)], axis="columns", ignore_index=True
        )
        .rename(columns={0: "question", 1: ("q_length")})
        .T
    )

    # separate survey answers
    survey = kag.iloc[1:]

multipleChoiceResponses.csv
freeFormResponses.csv
SurveySchema.csv

/tmp/ipykernel_60504/1388458452.py:4: DtypeWarning: Columns (0,2,8,10,21,23,24,25,26,27,28,42,44,54,56,64,81,83,85,87,105,107,109,121,123,125,148,150,157,172,174,192,194,210,218,219,221,223,246,247,249,262,264,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,302,304,306,325,326,329,341,368,371,384,385,389,390,391,393,394) have mixed types. Specify dtype option on import or set low_memory=False.
  kag = pd.read_csv(z.open("multipleChoiceResponses.csv"))

,Time from Start to Finish (seconds),Q1,Q1_OTHER_TEXT,Q2,...,Q50_Part_6,Q50_Part_7,Q50_Part_8,Q50_OTHER_TEXT
0,Duration (in seconds),What is your gender? - Selected Choice,What is your gender? - Prefer to sel...,What is your age (# years)?,...,What barriers prevent you from makin...,What barriers prevent you from makin...,What barriers prevent you from makin...,What barriers prevent you from makin...
1,710,Female,-1,45-49,...,NaN,NaN,NaN,-1
2,434,Male,-1,30-34,...,NaN,NaN,NaN,-1
3,718,Female,-1,30-34,...,NaN,NaN,NaN,-1
4,621,Male,-1,35-39,...,NaN,NaN,NaN,-1
...,...,...,...,...,...,...,...,...,...
23855,575,Male,-1,45-49,...,NaN,NaN,NaN,-1
23856,131,Female,-1,25-29,...,NaN,NaN,NaN,-1
23857,370,Male,-1,22-24,...,NaN,NaN,NaN,-1
23858,36,Male,-1,25-29,...,NaN,NaN,NaN,-1
23859,502,Male,-1,25-29,...,NaN,NaN,NaN,-1

,Time from Start to Finish (seconds),Q1,Q1_OTHER_TEXT,Q2,...,Q50_Part_6,Q50_Part_7,Q50_Part_8,Q50_OTHER_TEXT
question,Duration (in seconds),What is your gender? - Selected Choice,What is your gender? - Prefer to sel...,What is your age (# years)?,...,What barriers prevent you from makin...,What barriers prevent you from makin...,What barriers prevent you from makin...,What barriers prevent you from makin...
q_length,21,38,53,27,...,196,161,133,122

In [55]:
survey.head(2).T

                                                            1          2
Time from Start to Finish (seconds)                       710        434
Q1                                                     Female       Male
Q1_OTHER_TEXT                                              -1         -1
Q2                                                      45-49      30-34
Q3                                   United States of America  Indonesia
...                                                       ...        ...
Q50_Part_5                                                NaN        NaN
Q50_Part_6                                                NaN        NaN
Q50_Part_7                                                NaN        NaN
Q50_Part_8                                                NaN        NaN
Q50_OTHER_TEXT                                             -1         -1

[395 rows x 2 columns]

### How it works\...

### There\'s more\...

### How to do it\...

**Saving and reading - Sqlite**

In [56]:
import sqlite3

con = sqlite3.connect("../data/beat.db")
with con:
    cur = con.cursor()
    cur.execute("""DROP TABLE Band""")
    cur.execute("""CREATE TABLE Band(id INTEGER PRIMARY KEY,
        fname TEXT, lname TEXT, birthyear INT)""")
    cur.execute("""INSERT INTO Band VALUES(
        0, 'Paul', 'McCartney', 1942)""")
    cur.execute("""INSERT INTO Band VALUES(
        1, 'John', 'Lennon', 1940)""")
    _ = con.commit()

In [57]:
engine = sa.create_engine("sqlite:///../data/beat.db", echo=True)
sa_connection = engine.connect()

In [58]:
beat = pd.read_sql("Band", sa_connection, index_col="id")
beat

2025-11-28 14:38:33,535 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-11-28 14:38:33,537 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Band")
2025-11-28 14:38:33,538 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,542 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2025-11-28 14:38:33,544 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,545 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='view' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2025-11-28 14:38:33,545 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,546 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("Band")
2025-11-28 14:38:33,546 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,548 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2025-11-28 14:38:33,550 INFO sqlalchemy.engine.Engine [raw sql] ('Band',)
2025-11-28 14:38:33,552 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("Band")
2025-11-28 14:38:33,552 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,553 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("Band")
2025-11-28 14:38:33,554 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,555 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2025-11-28 14:38:33,555 INFO sqlalchemy.engine.Engine [raw sql] ('Band',)
2025-11-28 14:38:33,556 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("Band")
2025-11-28 14:38:33,557 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,558 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("Band")
2025-11-28 14:38:33,560 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,561 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Band")
2025-11-28 14:38:33,563 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,564 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("Band")
2025-11-28 14:38:33,564 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,565 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("Band")
2025-11-28 14:38:33,565 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,566 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Band")
2025-11-28 14:38:33,566 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,568 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2025-11-28 14:38:33,569 INFO sqlalchemy.engine.Engine [raw sql] ('Band',)
2025-11-28 14:38:33,573 INFO sqlalchemy.engine.Engine SELECT "Band".id, "Band".fname, "Band".lname, "Band".birthyear
FROM "Band"
2025-11-28 14:38:33,574 INFO sqlalchemy.engine.Engine [generated in 0.00073s] ()

   fname      lname  birthyear
id
0   Paul  McCartney       1942
1   John     Lennon       1940

In [59]:
sql = """SELECT fname, birthyear from Band"""
fnames = pd.read_sql(sql, con)
fnames

  fname  birthyear
0  Paul       1942
1  John       1940

In [60]:
sql = """SELECT fname, birthyear from Band"""
fnames = pd.read_sql(sql, sa_connection)
fnames

2025-11-28 14:38:33,600 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("SELECT fname, birthyear from Band")
2025-11-28 14:38:33,601 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,602 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("SELECT fname, birthyear from Band")
2025-11-28 14:38:33,602 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-11-28 14:38:33,603 INFO sqlalchemy.engine.Engine SELECT fname, birthyear from Band
2025-11-28 14:38:33,603 INFO sqlalchemy.engine.Engine [raw sql] ()

  fname  birthyear
0  Paul       1942
1  John       1940

### How it work\'s\...

In [61]:
people

{'first': ['Paul', 'John', 'Richard', 'George'],
 'last': ['McCartney', 'Lennon', 'Starkey', 'Harrison'],
 'birth': [1942, 1940, 1940, 1943]}

In [62]:
encoded = json.dumps(people)
encoded

'{"first": ["Paul", "John", "Richard", "George"], "last": ["McCartney", "Lennon", "Starkey", "Harrison"], "birth": [1942, 1940, 1940, 1943]}'

In [63]:
json.loads(encoded)

{'first': ['Paul', 'John', 'Richard', 'George'],
 'last': ['McCartney', 'Lennon', 'Starkey', 'Harrison'],
 'birth': [1942, 1940, 1940, 1943]}

### How to do it\...

In [64]:
# FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version.
# To read from a literal string, wrap it in a 'StringIO' object.
# beatles = pd.read_json(encoded)

beatles = pd.read_json(StringIO(encoded))
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [65]:
records = beatles.to_json(orient="records")
records

'[{"first":"Paul","last":"McCartney","birth":1942},{"first":"John","last":"Lennon","birth":1940},{"first":"Richard","last":"Starkey","birth":1940},{"first":"George","last":"Harrison","birth":1943}]'

In [66]:
pd.read_json(StringIO(records), orient="records")

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [67]:
split = beatles.to_json(orient="split")
split

'{"columns":["first","last","birth"],"index":[0,1,2,3],"data":[["Paul","McCartney",1942],["John","Lennon",1940],["Richard","Starkey",1940],["George","Harrison",1943]]}'

In [68]:
pd.read_json(StringIO(split), orient="split")

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [69]:
index = beatles.to_json(orient="index")
index

'{"0":{"first":"Paul","last":"McCartney","birth":1942},"1":{"first":"John","last":"Lennon","birth":1940},"2":{"first":"Richard","last":"Starkey","birth":1940},"3":{"first":"George","last":"Harrison","birth":1943}}'

In [70]:
pd.read_json(StringIO(index), orient="index")

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [71]:
values = beatles.to_json(orient="values")
values

'[["Paul","McCartney",1942],["John","Lennon",1940],["Richard","Starkey",1940],["George","Harrison",1943]]'

In [72]:
pd.read_json(StringIO(values), orient="values")

         0          1     2
0     Paul  McCartney  1942
1     John     Lennon  1940
2  Richard    Starkey  1940
3   George   Harrison  1943

In [73]:
(
    pd.read_json(StringIO(values), orient="values").rename(
        columns=dict(enumerate(["first", "last", "birth"]))
    )
)

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [74]:
table = beatles.to_json(orient="table")
table

'{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"first","type":"string"},{"name":"last","type":"string"},{"name":"birth","type":"integer"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":0,"first":"Paul","last":"McCartney","birth":1942},{"index":1,"first":"John","last":"Lennon","birth":1940},{"index":2,"first":"Richard","last":"Starkey","birth":1940},{"index":3,"first":"George","last":"Harrison","birth":1943}]}'

In [75]:
pd.read_json(StringIO(table), orient="table")

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

### How it works\...

### There\'s more\...

In [76]:
output = beat.to_dict()
output

{'fname': {0: 'Paul', 1: 'John'},
 'lname': {0: 'McCartney', 1: 'Lennon'},
 'birthyear': {0: 1942, 1: 1940}}

In [77]:
output["version"] = "0.4.1"
json.dumps(output)

'{"fname": {"0": "Paul", "1": "John"}, "lname": {"0": "McCartney", "1": "Lennon"}, "birthyear": {"0": 1942, "1": 1940}, "version": "0.4.1"}'

### How to do it\...

In [78]:
from urllib.error import HTTPError

try:
    url = "https://en.wikipedia.org/wiki/The_Beatles_discography"
    dfs = pd.read_html(url)
    len(dfs)
except HTTPError as e:
    print("HTTPError", e)
    print(
        "Check if your machine has access to internet, or if the web page still exists"
    )

HTTPError HTTP Error 403: Forbidden
Check if your machine has access to internet, or if the web page still exists

In [79]:
try:
    url = "https://en.wikipedia.org/wiki/The_Beatles_discography"
    dfs = pd.read_html(url, match="List of studio albums", na_values="â€”")
    display(len(dfs))
    display(dfs[0])
    display(dfs[0].columns)
except HTTPError as e:
    print("HTTPError", e)
    print("Check if your machine has access to internet, or if the web page still exists")

HTTPError HTTP Error 403: Forbidden
Check if your machine has access to internet, or if the web page still exists

In [80]:
try:
    url = "https://en.wikipedia.org/wiki/The_Beatles_discography"
    dfs = pd.read_html(url, match="List of studio albums", na_values="â€”", header=[0, 1])
    display(len(dfs))
    display(dfs[0])
    display(dfs[0].columns)

    df = dfs[0]
    df.columns = [
        "Title",
        "Release",
        "UK",
        "AUS",
        "CAN",
        "FRA",
        "GER",
        "NOR",
        "US",
        "Certifications",
    ]
    display(df)

except HTTPError as e:
    print("HTTPError", e)
    print(
        "Check if your machine has access to internet, or if the web page still exists"
    )

HTTPError HTTP Error 403: Forbidden
Check if your machine has access to internet, or if the web page still exists

In [81]:
# only if previous cell was succesful
if 'df' in dir():
    res = (
        df.pipe(lambda df_: df_[~df_.Title.str.startswith("Released")])
        .iloc[:-1]
        .assign(
            release_date=lambda df_: pd.to_datetime(
                df_.Release.str.extract(r"Released: (.*) Label")[0].str.replace(
                    r"\[E\]", ""
                )
            ),
            label=lambda df_: df_.Release.str.extract(r"Label: (.*)"),
        )
        .loc[
            :,
            [
                "Title",
                "UK",
                "AUS",
                "CAN",
                "FRA",
                "GER",
                "NOR",
                "US",
                "release_date",
                "label",
            ],
        ]
    )
    display(res)

### How it works\...

### There is more\...

In [82]:
# Use the raw URL (for read_csv)
try:
    url = "https://github.com/mattharrison/datasets/blob/master/data/anscombes.csv"

    # Try finding any tables on the page
    dfs = pd.read_html(url)
    print(f"Found {len(dfs)} table(s)")
    if len(dfs) > 0:
        df = dfs[0]
        display(df)

except ValueError as e:
    print("ValueError", e)
    url = "https://raw.githubusercontent.com/mattharrison/datasets/refs/heads/master/data/anscombes.csv"
    print(f"Trying with read_csv on the raw page: {url=}")
    dfs = pd.read_csv(url)
    display(len(dfs))
    display(dfs)


except HTTPError as e:
    print("HTTPError", e)
    print(
        "Check if your machine has access to internet, or if the web page still exists"
    )

ValueError No tables found
Trying with read_csv on the raw page: url='https://raw.githubusercontent.com/mattharrison/datasets/refs/heads/master/data/anscombes.csv'

55

   quadrant     x     y
0         I  10.0  8.04
1         I  14.0  9.96
2         I   6.0  7.24
3         I   9.0  8.81
4         I   4.0  4.26
..      ...   ...   ...
50        V   6.0  5.80
51        V   4.0  6.03
52        V  12.0  9.61
53        V   7.0  5.68
54        V   5.0  5.92

[55 rows x 3 columns]